/*
SQLyog Ultimate v8.32 
MySQL - 5.1.51-community : Database - db_car
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`db_car` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `db_car`;

/*Table structure for table `tab_car` */

DROP TABLE IF EXISTS `tab_car`;

CREATE TABLE `tab_car` (
  `car_id` varchar(50) NOT NULL,
  `car_logo` varchar(50) DEFAULT NULL,
  `car_number` char(7) DEFAULT NULL,
  `car_time` datetime DEFAULT NULL,
  `car_zuo` int(11) DEFAULT NULL,
  `car_color` char(1) DEFAULT NULL,
  `car_price` decimal(10,1) DEFAULT NULL,
  `car_photo` varchar(100) DEFAULT NULL,
  `car_status` int(11) DEFAULT '1' COMMENT '车辆状态：1 未租，2 已租,3 不可以',
  PRIMARY KEY (`car_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_car` */

insert  into `tab_car`(`car_id`,`car_logo`,`car_number`,`car_time`,`car_zuo`,`car_color`,`car_price`,`car_photo`,`car_status`) values ('car_0011','宝来','豫A88888','2021-05-04 00:00:00',4,'百','100000.0','car_0011.jpeg',1),('car_0012','特斯拉','豫A88881','2020-01-21 11:11:11',7,'黑','200000.0','car_0012.jpeg',1),('car_0013','宝马','豫A88882','2020-01-11 11:11:11',6,'白','300000.0','car_0013.jpeg',1),('car_3e7438032cbf4e609b9cfc05d63013a6','法拉利','豫A22222','2021-05-27 00:00:00',2,'红','33333.0','car_3e7438032cbf4e609b9cfc05d63013a6.jpeg',1),('car_49f84ffd68724fb594f523f24f7ec826','酷路泽','豫C44444','2021-05-22 00:00:00',7,'黑','11111.0','car_49f84ffd68724fb594f523f24f7ec826.jpeg',1),('car_7756396bbd1c48c1b05097500e0cfd1b','五菱宏光','豫A11111','2021-05-04 00:00:00',1,'红','11111.0','car_7756396bbd1c48c1b05097500e0cfd1b.jpeg',1),('car_8f4c64db004741c79f8521d41138b660','保时捷','豫B33333','2021-05-20 00:00:00',4,'黑','22222.0','car_8f4c64db004741c79f8521d41138b660.jpeg',1),('car_c16adfed07d84b31a473f66d66d679ef','奔驰','豫B99999','2021-05-25 00:00:00',1,'白','111.0','car_c16adfed07d84b31a473f66d66d679ef.jpeg',1);

/*Table structure for table `tab_car_check` */

DROP TABLE IF EXISTS `tab_car_check`;

CREATE TABLE `tab_car_check` (
  `car_check_id` varchar(50) NOT NULL,
  `car_id` varchar(50) DEFAULT NULL,
  `car_check_time` datetime DEFAULT NULL,
  `car_describe` varchar(1000) DEFAULT NULL,
  `user_id` varchar(50) DEFAULT NULL,
  `car_check_status` int(11) DEFAULT '1',
  PRIMARY KEY (`car_check_id`),
  KEY `fk_17` (`car_id`),
  KEY `fk_16` (`user_id`),
  CONSTRAINT `fk_16` FOREIGN KEY (`user_id`) REFERENCES `tab_user` (`user_id`),
  CONSTRAINT `fk_17` FOREIGN KEY (`car_id`) REFERENCES `tab_car` (`car_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_car_check` */

insert  into `tab_car_check`(`car_check_id`,`car_id`,`car_check_time`,`car_describe`,`user_id`,`car_check_status`) values ('car_check_0370b2e49abd471e867fb5c9661ff1c0','car_0012','2021-05-13 13:07:39','2222','user_0011',-1),('car_check_6ae63ddc40ab4f8c9efb7e86297d2401','car_0011','2021-05-13 13:07:30','111111','user_0011',1),('car_check_9375ea1e405747e594b8f87314039dd8','car_0013','2021-05-13 13:15:25','1111','user_0011',1);

/*Table structure for table `tab_car_in` */

DROP TABLE IF EXISTS `tab_car_in`;

CREATE TABLE `tab_car_in` (
  `car_in_id` varchar(50) NOT NULL,
  `car_out_id` varchar(50) DEFAULT NULL,
  `car_check_id` varchar(50) DEFAULT NULL,
  `car_in_time` datetime DEFAULT NULL,
  `car_in_oil` float(100,1) DEFAULT NULL COMMENT '油量',
  `car_in_money` decimal(10,1) DEFAULT NULL COMMENT '总租金',
  `car_in_feedback` varchar(400) DEFAULT NULL COMMENT '用车反馈',
  `user_id` varchar(50) DEFAULT NULL,
  `car_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`car_in_id`),
  KEY `fk_18` (`car_out_id`),
  KEY `fk_19` (`car_check_id`),
  KEY `fk_1001` (`user_id`),
  KEY `fk_1010` (`car_id`),
  CONSTRAINT `fk_1001` FOREIGN KEY (`user_id`) REFERENCES `tab_user` (`user_id`),
  CONSTRAINT `fk_1010` FOREIGN KEY (`car_id`) REFERENCES `tab_car` (`car_id`),
  CONSTRAINT `fk_18` FOREIGN KEY (`car_out_id`) REFERENCES `tab_car_out` (`car_out_id`),
  CONSTRAINT `fk_19` FOREIGN KEY (`car_check_id`) REFERENCES `tab_car_check` (`car_check_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_car_in` */

insert  into `tab_car_in`(`car_in_id`,`car_out_id`,`car_check_id`,`car_in_time`,`car_in_oil`,`car_in_money`,`car_in_feedback`,`user_id`,`car_id`) values ('car_in_7225448f3e8446adbef87bd344da2d3e','car_out_c7fdc2bacc804ec3852e51fa8a3f823b','car_check_9375ea1e405747e594b8f87314039dd8','2021-05-13 13:16:41',11.0,'11.0','111111','user_0011','car_0013'),('car_in_ee0299885d5d4e7285b7f6a765f8a5b1',NULL,NULL,'2021-05-13 13:09:25',2.0,'2.0','2222','user_0011','car_0011');

/*Table structure for table `tab_car_out` */

DROP TABLE IF EXISTS `tab_car_out`;

CREATE TABLE `tab_car_out` (
  `car_out_id` varchar(50) NOT NULL,
  `car_id` varchar(50) DEFAULT NULL,
  `customer_id` varchar(50) DEFAULT NULL,
  `car_check_id` varchar(50) DEFAULT NULL,
  `car_out_start_time` datetime DEFAULT NULL,
  `car_out_end_time` datetime DEFAULT NULL,
  `car_out_day_price` decimal(6,1) DEFAULT NULL COMMENT '天租金',
  `car_out_deposit` decimal(7,1) DEFAULT NULL COMMENT '押金',
  `car_out_oil` float(100,1) DEFAULT NULL COMMENT '油量',
  `user_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`car_out_id`),
  KEY `fk_21` (`car_check_id`),
  KEY `fk_22` (`customer_id`),
  KEY `fk_23` (`car_id`),
  KEY `fk_1000` (`user_id`),
  CONSTRAINT `fk_1000` FOREIGN KEY (`user_id`) REFERENCES `tab_user` (`user_id`),
  CONSTRAINT `fk_21` FOREIGN KEY (`car_check_id`) REFERENCES `tab_car_check` (`car_check_id`),
  CONSTRAINT `fk_22` FOREIGN KEY (`customer_id`) REFERENCES `tab_customer` (`customer_id`),
  CONSTRAINT `fk_23` FOREIGN KEY (`car_id`) REFERENCES `tab_car` (`car_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_car_out` */

insert  into `tab_car_out`(`car_out_id`,`car_id`,`customer_id`,`car_check_id`,`car_out_start_time`,`car_out_end_time`,`car_out_day_price`,`car_out_deposit`,`car_out_oil`,`user_id`) values ('car_out_c13141fb0f7f4ee3918b9148b3dd4a85','car_0011','customer_003',NULL,'2021-05-13 13:09:14','2021-05-14 00:00:00','1.0','1.0',1.0,'user_0011'),('car_out_c7fdc2bacc804ec3852e51fa8a3f823b','car_0013','customer_004','car_check_9375ea1e405747e594b8f87314039dd8','2021-05-13 13:15:59','2021-05-14 00:00:00','11.0','11.0',11.0,'user_0011');

/*Table structure for table `tab_customer` */

DROP TABLE IF EXISTS `tab_customer`;

CREATE TABLE `tab_customer` (
  `customer_id` varchar(50) NOT NULL,
  `customer_name` varchar(50) DEFAULT NULL,
  `customer_sex` char(1) DEFAULT NULL,
  `customer_phone` char(11) DEFAULT NULL,
  `customer_pid` char(18) DEFAULT NULL,
  `customer_job` varchar(18) DEFAULT NULL,
  `customer_address` varchar(100) DEFAULT NULL,
  `customer_photo` varchar(100) DEFAULT NULL,
  `customer_status` int(11) DEFAULT '1',
  `customer_time` datetime DEFAULT NULL,
  PRIMARY KEY (`customer_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_customer` */

insert  into `tab_customer`(`customer_id`,`customer_name`,`customer_sex`,`customer_phone`,`customer_pid`,`customer_job`,`customer_address`,`customer_photo`,`customer_status`,`customer_time`) values ('customer_0','7b8aeb64','男','15036088050','410185198602221908','会计','河南-郑州','customer_003.jpg',1,'2014-06-09 00:00:00'),('customer_003','王五五','男','15036088042','410186198502222223','会计','河南-郑州','customer_003.jpg',1,'2017-12-18 00:00:00'),('customer_004','赵六','男','15036088043','410186198502222224','司机','河南-郑州','customer_004.jpg',1,'2010-05-21 00:00:00'),('customer_005','田七','男','15036088044','410186198502222225','小贩','河南-郑州','customer_005.jpg',1,'2014-03-16 00:00:00'),('customer_006','吴八','男','15036088045','410186198502222226','无业','河南-郑州','customer_006.jpg',1,'2010-07-19 00:00:00'),('customer_007','苗九','男','15036088045','410186198502222226','无业','河南-郑州','customer_007.jpg',1,'2015-09-02 00:00:00'),('customer_082491c1bb3c40908be1d9be214ddefc','韩梅梅','男','18860388000','410185198502225536','护士','云南省-大理','customer_082491c1bb3c40908be1d9be214ddefc.jpeg',1,'2010-03-28 00:00:00'),('customer_1','88d15af7','女','15036088013','410185198602221373','会计','河北-邯郸','customer_003.jpg',1,'2014-06-05 00:00:00'),('customer_10','7db1e7b7','男','15036088077','410185198602221650','会计','河南-郑州','customer_003.jpg',1,'2010-11-08 00:00:00'),('customer_101','98c024af','女','15036088081','410185198602221567','老师','江西-九州','customer_003.jpg',1,'2021-05-17 00:00:00'),('customer_105','b5db559a','男','15036088051','410185198602221216','会计','海南-三亚','customer_003.jpg',1,'2017-11-05 00:00:00'),('customer_112','ab8274f3','男','1503608809','410185198602221595','会计','北京-海淀','customer_003.jpg',1,'2018-09-05 00:00:00'),('customer_114','b7041811','男','15036088017','410185198602221961','会计','海南-三亚','customer_003.jpg',1,'2011-03-23 00:00:00'),('customer_132','c37afa7f','女','15036088063','410185198602221426','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2011-11-24 00:00:00'),('customer_135','8c885bba','女','15036088088','410185198602221021','学生','贵州-贵阳','customer_003.jpg',1,'2021-03-17 00:00:00'),('customer_137','dd8b627b','男','15036088091','410185198602221971','会计','甘肃-酒泉','customer_003.jpg',1,'2020-03-27 00:00:00'),('customer_140','b60d8478','男','15036088055','410185198602221147','会计','海南-三亚','customer_003.jpg',1,'2018-04-07 00:00:00'),('customer_15','7cc58753','女','15036088077','410185198602221942','会计','河南-郑州','customer_003.jpg',1,'2011-03-22 00:00:00'),('customer_150','8ba8f362','女','15036088044','410185198602221706','学生','贵州-贵阳','customer_003.jpg',1,'2021-09-05 00:00:00'),('customer_154','abc5dd41','男','15036088034','410185198602221616','会计','北京-海淀','customer_003.jpg',1,'2014-03-20 00:00:00'),('customer_160','abdf48a1','男','15036088026','410185198602221633','会计','北京-海淀','customer_003.jpg',1,'2015-09-29 00:00:00'),('customer_165','c299024a','女','15036088058','410185198602221920','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2017-09-13 00:00:00'),('customer_168','dda58226','男','15036088014','410185198602221317','会计','甘肃-酒泉','customer_003.jpg',1,'2020-03-06 00:00:00'),('customer_17','b47c498b','男','15036088085','410185198602221330','会计','海南-三亚','customer_003.jpg',1,'2020-02-29 00:00:00'),('customer_170','de60a2d4','女','15036088091','410185198602221767','会计','甘肃-酒泉','customer_003.jpg',1,'2013-11-15 00:00:00'),('customer_171','8a9c2c94','男','15036088099','410185198602221619','学生','贵州-贵阳','customer_003.jpg',1,'2021-06-13 00:00:00'),('customer_174','78dddbaa','男','15036088099','410185198602221733','护士','安徽-亳州','customer_003.jpg',1,'2021-11-08 00:00:00'),('customer_177','98db92ef','女','15036088038','410185198602221749','老师','江西-九州','customer_003.jpg',1,'2021-05-24 00:00:00'),('customer_178','77463b9a','女','1503608807','410185198602221000','护士','安徽-亳州','customer_003.jpg',1,'2021-01-25 00:00:00'),('customer_18','8996a9e9','男','15036088039','410185198602221688','会计','河北-邯郸','customer_003.jpg',1,'2012-11-27 00:00:00'),('customer_180','b6eb7758','男','15036088024','410185198602221890','会计','海南-三亚','customer_003.jpg',1,'2014-02-14 00:00:00'),('customer_181','b7c0e099','女','15036088024','410185198602221893','会计','海南-三亚','customer_003.jpg',1,'2011-01-18 00:00:00'),('customer_183','b58d48f3','女','15036088085','410185198602221877','会计','海南-三亚','customer_003.jpg',1,'2019-07-10 00:00:00'),('customer_20','de9539b7','女','15036088042','410185198602221923','会计','甘肃-酒泉','customer_003.jpg',1,'2019-12-05 00:00:00'),('customer_21','7d9a10ec','女','15036088041','410185198602221296','会计','河南-郑州','customer_003.jpg',1,'2019-01-14 00:00:00'),('customer_212','b39af516','男','15036088049','410185198602221393','会计','海南-三亚','customer_003.jpg',1,'2010-07-25 00:00:00'),('customer_214','78c32cfc','男','15036088014','410185198602221723','护士','安徽-亳州','customer_003.jpg',1,'2021-06-25 00:00:00'),('customer_215','c331ab46','女','15036088082','410185198602221756','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2012-10-07 00:00:00'),('customer_219','8ae45116','女','15036088065','410185198602221839','学生','贵州-贵阳','customer_003.jpg',1,'2021-06-14 00:00:00'),('customer_22','8965f592','女','15036088084','410185198602221683','会计','河北-邯郸','customer_003.jpg',1,'2013-12-28 00:00:00'),('customer_227','dcf02194','男','15036088021','410185198602221338','会计','甘肃-酒泉','customer_003.jpg',1,'2011-02-05 00:00:00'),('customer_23','8a27b483','女','15036088024','410185198602221281','会计','河北-邯郸','customer_003.jpg',1,'2010-07-18 00:00:00'),('customer_234','c3a84dd0','男','1503608801','410185198602221767','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2012-02-02 00:00:00'),('customer_25fed5a24a4c4217a1224982d3f71795','韩梅梅','男','18860388000','410185198502225536','护士','北京-海淀','customer_25fed5a24a4c4217a1224982d3f71795.jpeg',1,'2011-01-22 00:00:00'),('customer_269','dd08c8bb','女','15036088085','410185198602221910','会计','甘肃-酒泉','customer_003.jpg',1,'2013-10-09 00:00:00'),('customer_275','8d4b8280','男','15036088035','410185198602221694','学生','贵州-贵阳','customer_003.jpg',1,'2021-04-10 00:00:00'),('customer_276','dd3f8f7c','男','1503608803','410185198602221251','会计','甘肃-酒泉','customer_003.jpg',1,'2019-02-04 00:00:00'),('customer_278','aaa1205f','女','15036088034','410185198602221317','会计','北京-海淀','customer_003.jpg',1,'2014-12-20 00:00:00'),('customer_283','9e5e5b9a','女','15036088099','410185198602221994','会计','天津-塘沽','customer_003.jpg',1,'2015-04-06 00:00:00'),('customer_285','990b42c1','男','15036088020','410185198602221364','老师','江西-九州','customer_003.jpg',1,'2021-03-12 00:00:00'),('customer_287','780ea573','男','1503608802','410185198602221228','护士','安徽-亳州','customer_003.jpg',1,'2021-10-28 00:00:00'),('customer_288','c2166f5a','男','15036088046','410185198602221901','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2017-03-28 00:00:00'),('customer_289','ab6a239b','女','15036088080','410185198602221226','会计','北京-海淀','customer_003.jpg',1,'2010-08-01 00:00:00'),('customer_2a46324bd1bd46d28cda3684fecddb14','呵呵呵','女','19919919911','410185198502229991','护士','云南省-大理','customer_2a46324bd1bd46d28cda3684fecddb14.jpeg',1,'2015-06-22 00:00:00'),('customer_2ec08bb652a14aea9b77fe1f90d834a5','武大郎','男','15036088040','410185198502229999','嘻嘻哈哈','天津-塘沽','customer_2ec08bb652a14aea9b77fe1f90d834a5.jpg',-1,'2011-08-24 00:00:00'),('customer_305','b366c5e4','女','15036088014','410185198602221203','会计','海南-三亚','customer_003.jpg',1,'2011-01-26 00:00:00'),('customer_306','b7eee23e','女','15036088019','410185198602221774','会计','海南-三亚','customer_003.jpg',1,'2017-12-16 00:00:00'),('customer_31','c2cb66f3','男','15036088052','410185198602221358','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2014-09-03 00:00:00'),('customer_316','c1fcddc5','女','15036088041','410185198602221525','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2017-01-04 00:00:00'),('customer_318','8b744c37','男','15036088097','410185198602221487','学生','贵州-贵阳','customer_003.jpg',1,'2021-11-20 00:00:00'),('customer_334','ac385bca','男','1503608805','410185198602221104','会计','北京-海淀','customer_003.jpg',1,'2014-02-03 00:00:00'),('customer_337','9dd0a70a','男','15036088074','410185198602221377','会计','天津-塘沽','customer_003.jpg',1,'2019-01-22 00:00:00'),('customer_345','ab066e54','男','15036088068','410185198602221531','会计','北京-海淀','customer_003.jpg',1,'2016-12-26 00:00:00'),('customer_347','b809d647','女','1503608803','410185198602221207','会计','海南-三亚','customer_003.jpg',1,'2020-07-23 00:00:00'),('customer_35','7c972ef7','男','15036088039','410185198602221744','会计','河南-郑州','customer_003.jpg',1,'2013-03-09 00:00:00'),('customer_351','abf2c2b5','男','15036088022','410185198602221598','会计','北京-海淀','customer_003.jpg',1,'2016-02-24 00:00:00'),('customer_356','9d1f15f0','女','1503608800','410185198602221007','会计','天津-塘沽','customer_003.jpg',1,'2014-11-04 00:00:00'),('customer_360','aa88a541','女','15036088099','410185198602221653','会计','北京-海淀','customer_003.jpg',1,'2013-08-10 00:00:00'),('customer_361','b688e34c','男','15036088033','410185198602221669','会计','海南-三亚','customer_003.jpg',1,'2010-02-19 00:00:00'),('customer_362','7829bee1','女','15036088053','410185198602221013','护士','安徽-亳州','customer_003.jpg',1,'2021-04-30 00:00:00'),('customer_364','de7aa94d','男','15036088050','410185198602221335','会计','甘肃-酒泉','customer_003.jpg',1,'2020-05-27 00:00:00'),('customer_368','b76f9072','男','15036088055','410185198602221593','会计','海南-三亚','customer_003.jpg',1,'2020-02-24 00:00:00'),('customer_379','c1e0cf41','男','15036088070','410185198602221036','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2012-11-29 00:00:00'),('customer_38','7d394a3b','男','15036088075','410185198602221065','会计','河南-郑州','customer_003.jpg',1,'2010-12-18 00:00:00'),('customer_39','8e10de6e','女','1503608805','410185198602221752','会计','河北-邯郸','customer_003.jpg',1,'2011-07-09 00:00:00'),('customer_394','98f56e53','男','15036088043','410185198602221938','老师','江西-九州','customer_003.jpg',1,'2021-01-25 00:00:00'),('customer_397','c2b1b981','女','15036088093','410185198602221478','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2020-02-24 00:00:00'),('customer_406','8c6d5b96','男','15036088034','410185198602221539','学生','贵州-贵阳','customer_003.jpg',1,'2021-07-26 00:00:00'),('customer_407','b419ca93','女','15036088098','410185198602221932','会计','海南-三亚','customer_003.jpg',1,'2016-01-13 00:00:00'),('customer_41','891b3729','女','15036088026','410185198602221534','会计','河北-邯郸','customer_003.jpg',1,'2014-04-09 00:00:00'),('customer_410','b5263338','女','15036088079','410185198602221456','会计','海南-三亚','customer_003.jpg',1,'2020-05-04 00:00:00'),('customer_414','dc1ce6f2','男','15036088099','410185198602221162','会计','甘肃-酒泉','customer_003.jpg',1,'2010-03-29 00:00:00'),('customer_415','9e73381c','女','15036088021','410185198602221018','会计','天津-塘沽','customer_003.jpg',1,'2018-05-13 00:00:00'),('customer_42','88ea21bd','女','15036088080','410185198602221721','会计','河北-邯郸','customer_003.jpg',1,'2020-07-20 00:00:00'),('customer_423','b44b43f9','女','15036088078','410185198602221066','会计','海南-三亚','customer_003.jpg',1,'2019-02-27 00:00:00'),('customer_426','785bad4b','女','15036088066','410185198602221054','护士','安徽-亳州','customer_003.jpg',1,'2021-10-27 00:00:00'),('customer_427','b432cf85','女','15036088042','410185198602221368','会计','海南-三亚','customer_003.jpg',1,'2011-03-25 00:00:00'),('customer_43','88b65eaa','女','15036088097','410185198602221216','会计','河北-邯郸','customer_003.jpg',1,'2017-08-01 00:00:00'),('customer_441','b4f4c0be','女','15036088012','410185198602221789','会计','海南-三亚','customer_003.jpg',1,'2018-06-02 00:00:00'),('customer_456','8bdac1e5','女','15036088042','410185198602221749','学生','贵州-贵阳','customer_003.jpg',1,'2021-08-29 00:00:00'),('customer_458','98a712be','男','15036088039','410185198602221094','老师','江西-九州','customer_003.jpg',1,'2021-09-14 00:00:00'),('customer_460','b5a6e1a8','男','15036088097','410185198602221381','会计','海南-三亚','customer_003.jpg',1,'2019-05-10 00:00:00'),('customer_462','aaec9907','男','15036088017','410185198602221928','会计','北京-海淀','customer_003.jpg',1,'2013-01-13 00:00:00'),('customer_466','8c9e50a4','女','15036088092','410185198602221794','学生','贵州-贵阳','customer_003.jpg',1,'2021-11-15 00:00:00'),('customer_468','c2679d4e','女','15036088034','410185198602221841','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2012-04-23 00:00:00'),('customer_47','8bc1965b','女','15036088043','410185198602221040','学生','贵州-贵阳','customer_003.jpg',1,'2021-11-28 00:00:00'),('customer_475','b4c2bc7f','女','15036088016','410185198602221155','会计','海南-三亚','customer_003.jpg',1,'2015-10-22 00:00:00'),('customer_479','b55acb8a','男','15036088016','410185198602221627','会计','海南-三亚','customer_003.jpg',1,'2010-10-25 00:00:00'),('customer_48','7dcabae0','女','15036088089','410185198602221737','会计','河南-郑州','customer_003.jpg',1,'2010-07-21 00:00:00'),('customer_481','9d51bcd3','女','15036088094','410185198602221260','会计','天津-塘沽','customer_003.jpg',1,'2015-09-26 00:00:00'),('customer_49','aa568ccb','女','15036088048','410185198602221101','会计','北京-海淀','customer_003.jpg',1,'2014-09-08 00:00:00'),('customer_492','b6a00526','女','15036088077','410185198602221103','会计','海南-三亚','customer_003.jpg',1,'2015-04-01 00:00:00'),('customer_496','abaee1ff','女','15036088065','410185198602221336','会计','北京-海淀','customer_003.jpg',1,'2020-12-26 00:00:00'),('customer_499','8b8f9c42','女','15036088068','410185198602221523','学生','贵州-贵阳','customer_003.jpg',1,'2021-04-15 00:00:00'),('customer_500','9e18dac3','女','15036088067','410185198602221985','会计','天津-塘沽','customer_003.jpg',1,'2017-04-11 00:00:00'),('customer_501','b6718172','女','15036088019','410185198602221307','会计','海南-三亚','customer_003.jpg',1,'2020-02-22 00:00:00'),('customer_502','c2fe8ca5','女','15036088015','410185198602221204','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2018-07-05 00:00:00'),('customer_507','78a864ad','女','15036088059','410185198602221438','护士','安徽-亳州','customer_003.jpg',1,'2021-04-20 00:00:00'),('customer_511','aad455f2','女','15036088091','410185198602221933','会计','北京-海淀','customer_003.jpg',1,'2017-09-13 00:00:00'),('customer_515','8b151a36','男','15036088067','410185198602221448','学生','贵州-贵阳','customer_003.jpg',1,'2021-11-06 00:00:00'),('customer_52','9e454670','女','15036088077','410185198602221082','会计','天津-塘沽','customer_003.jpg',1,'2013-04-12 00:00:00'),('customer_533','dcd60056','女','15036088091','410185198602221718','会计','甘肃-酒泉','customer_003.jpg',1,'2017-08-04 00:00:00'),('customer_536','c2e48f8b','男','15036088042','410185198602221059','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2013-04-18 00:00:00'),('customer_543','790c7fa0','男','15036088076','410185198602221318','护士','安徽-亳州','customer_003.jpg',1,'2021-03-17 00:00:00'),('customer_548','ab99bd39','男','15036088014','410185198602221684','会计','北京-海淀','customer_003.jpg',1,'2019-11-20 00:00:00'),('customer_55','ddc15d81','女','15036088046','410185198602221471','会计','甘肃-酒泉','customer_003.jpg',1,'2013-04-15 00:00:00'),('customer_552','dcbb7b7d','男','15036088054','410185198602221788','会计','甘肃-酒泉','customer_003.jpg',1,'2018-04-05 00:00:00'),('customer_554','dc69ce05','女','15036088011','410185198602221980','会计','甘肃-酒泉','customer_003.jpg',1,'2015-02-02 00:00:00'),('customer_556','b3cf698f','女','15036088036','410185198602221246','会计','海南-三亚','customer_003.jpg',1,'2012-11-24 00:00:00'),('customer_559','988af76e','男','15036088088','410185198602221179','老师','江西-九州','customer_003.jpg',1,'2021-04-25 00:00:00'),('customer_564','8cb7d7d5','女','15036088048','410185198602221443','学生','贵州-贵阳','customer_003.jpg',1,'2021-02-05 00:00:00'),('customer_569','ab51b2c7','男','15036088097','410185198602221704','会计','北京-海淀','customer_003.jpg',1,'2017-05-23 00:00:00'),('customer_577','c17e6867','男','15036088024','410185198602221931','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2012-07-28 00:00:00'),('customer_58','7cdd2497','女','15036088063','410185198602221561','会计','河南-郑州','customer_003.jpg',1,'2020-09-29 00:00:00'),('customer_583','8d1bf463','男','15036088043','410185198602221194','学生','贵州-贵阳','customer_003.jpg',1,'2021-09-02 00:00:00'),('customer_585','c3180898','女','15036088081','410185198602221261','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2011-04-01 00:00:00'),('customer_59','7d4f5d4b','男','1503608801','410185198602221490','会计','河南-郑州','customer_003.jpg',1,'2018-12-08 00:00:00'),('customer_593','77c1c343','男','1503608805','410185198602221103','护士','安徽-亳州','customer_003.jpg',1,'2021-05-20 00:00:00'),('customer_60','89df85ac','男','15036088046','410185198602221572','会计','河北-邯郸','customer_003.jpg',1,'2018-04-09 00:00:00'),('customer_603','b72377b1','女','15036088084','410185198602221363','会计','海南-三亚','customer_003.jpg',1,'2019-08-20 00:00:00'),('customer_604','b4ddb4ca','男','15036088097','410185198602221305','会计','海南-三亚','customer_003.jpg',1,'2012-01-21 00:00:00'),('customer_61','894d6a68','女','15036088044','410185198602221613','会计','河北-邯郸','customer_003.jpg',1,'2014-12-09 00:00:00'),('customer_613','77ddcbdb','男','15036088092','410185198602221464','护士','安徽-亳州','customer_003.jpg',1,'2021-05-04 00:00:00'),('customer_62','7de1ebf9','男','15036088069','410185198602221234','会计','河南-郑州','customer_003.jpg',1,'2018-08-25 00:00:00'),('customer_626','ab38d17b','女','15036088094','410185198602221370','会计','北京-海淀','customer_003.jpg',1,'2016-04-13 00:00:00'),('customer_634','99212fea','女','15036088049','410185198602221992','老师','江西-九州','customer_003.jpg',1,'2021-03-23 00:00:00'),('customer_64','8a7977fb','女','15036088098','410185198602221260','会计','河北-邯郸','customer_003.jpg',1,'2018-11-06 00:00:00'),('customer_640','7874587b','女','15036088027','410185198602221655','护士','安徽-亳州','customer_003.jpg',1,'2021-04-15 00:00:00'),('customer_649','b5f50dc0','男','1503608804','410185198602221902','会计','海南-三亚','customer_003.jpg',1,'2014-01-24 00:00:00'),('customer_654','8b2d5284','男','15036088067','410185198602221479','学生','贵州-贵阳','customer_003.jpg',1,'2021-07-26 00:00:00'),('customer_655','aabadb82','女','15036088064','410185198602221756','会计','北京-海淀','customer_003.jpg',1,'2013-06-13 00:00:00'),('customer_67','897ebed8','女','15036088063','410185198602221781','会计','河北-邯郸','customer_003.jpg',1,'2012-01-18 00:00:00'),('customer_680','ac0c5611','男','15036088098','410185198602221761','会计','北京-海淀','customer_003.jpg',1,'2011-08-29 00:00:00'),('customer_682','dc9f55d5','男','15036088095','410185198602221374','会计','甘肃-酒泉','customer_003.jpg',1,'2014-01-04 00:00:00'),('customer_69','7d6593cd','男','15036088083','410185198602221986','会计','河南-郑州','customer_003.jpg',1,'2012-08-18 00:00:00'),('customer_690','b4624abb','女','15036088019','410185198602221102','会计','海南-三亚','customer_003.jpg',1,'2012-07-05 00:00:00'),('customer_696','b4ab7a1d','女','15036088036','410185198602221752','会计','海南-三亚','customer_003.jpg',1,'2016-09-23 00:00:00'),('customer_70','7c7c34ea','男','15036088092','410185198602221294','会计','河南-郑州','customer_003.jpg',1,'2012-03-12 00:00:00'),('customer_701','c3c09652','女','15036088091','410185198602221989','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2020-02-21 00:00:00'),('customer_702','c1c70edc','男','15036088055','410185198602221709','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2016-04-22 00:00:00'),('customer_713','9d3917a6','男','15036088058','410185198602221775','会计','天津-塘沽','customer_003.jpg',1,'2013-09-24 00:00:00'),('customer_714','c249fa4d','女','1503608803','410185198602221064','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2010-03-29 00:00:00'),('customer_72','7d0d73a9','男','15036088065','410185198602221133','会计','河南-郑州','customer_003.jpg',1,'2014-12-18 00:00:00'),('customer_720','993af053','男','15036088095','410185198602221817','老师','江西-九州','customer_003.jpg',1,'2021-12-22 00:00:00'),('customer_724','b7d94bf8','男','15036088053','410185198602221702','会计','海南-三亚','customer_003.jpg',1,'2019-08-23 00:00:00'),('customer_725','8cd02e34','女','15036088031','410185198602221232','学生','贵州-贵阳','customer_003.jpg',1,'2021-09-14 00:00:00'),('customer_727','dc85f420','男','15036088029','410185198602221869','会计','甘肃-酒泉','customer_003.jpg',1,'2014-01-07 00:00:00'),('customer_729','dd254c2b','男','15036088039','410185198602221870','会计','甘肃-酒泉','customer_003.jpg',1,'2012-11-21 00:00:00'),('customer_731','b574dd0a','男','15036088068','410185198602221478','会计','海南-三亚','customer_003.jpg',1,'2010-05-23 00:00:00'),('customer_735','9d6a6a9f','男','15036088027','410185198602221151','会计','天津-塘沽','customer_003.jpg',1,'2017-08-30 00:00:00'),('customer_74','7df91e46','女','15036088078','410185198602221708','会计','河南-郑州','customer_003.jpg',1,'2019-03-08 00:00:00'),('customer_756','ddf68bb3','男','15036088038','410185198602221490','会计','甘肃-酒泉','customer_003.jpg',1,'2017-06-06 00:00:00'),('customer_76','7e0e3e25','男','15036088012','410185198602221730','会计','河南-郑州','customer_003.jpg',1,'2016-07-26 00:00:00'),('customer_762','9de9435d','男','15036088011','410185198602221449','会计','天津-塘沽','customer_003.jpg',1,'2015-05-03 00:00:00'),('customer_763','9d8505dc','女','15036088052','410185198602221517','会计','天津-塘沽','customer_003.jpg',1,'2016-03-07 00:00:00'),('customer_767','8c0bb3b7','男','15036088046','410185198602221568','学生','贵州-贵阳','customer_003.jpg',1,'2021-08-28 00:00:00'),('customer_774','aa6efe9c','男','15036088051','410185198602221195','会计','北京-海淀','customer_003.jpg',1,'2019-11-17 00:00:00'),('customer_778','c1647c5f','男','15036088023','410185198602221963','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2014-06-03 00:00:00'),('customer_78','78420af3','女','15036088052','410185198602221648','护士','安徽-亳州','customer_003.jpg',1,'2021-07-09 00:00:00'),('customer_780','c2317763','女','15036088064','410185198602221179','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2017-04-12 00:00:00'),('customer_783','b63e6849','女','15036088056','410185198602221181','会计','海南-三亚','customer_003.jpg',1,'2017-10-21 00:00:00'),('customer_79','89326103','女','15036088037','410185198602221943','会计','河北-邯郸','customer_003.jpg',1,'2018-12-11 00:00:00'),('customer_792','c3637c58','男','15036088047','410185198602221552','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2017-10-07 00:00:00'),('customer_798','8ce9d5ca','女','1503608807','410185198602221947','学生','贵州-贵阳','customer_003.jpg',1,'2021-07-09 00:00:00'),('customer_8','7e269b65','女','15036088084','410185198602221036','会计','河南-郑州','customer_003.jpg',1,'2016-05-08 00:00:00'),('customer_800','c1aedcf1','女','15036088067','410185198602221592','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2013-08-03 00:00:00'),('customer_802','b7a51423','男','15036088058','410185198602221516','会计','海南-三亚','customer_003.jpg',1,'2011-10-25 00:00:00'),('customer_809','788edd8c','女','15036088096','410185198602221771','护士','安徽-亳州','customer_003.jpg',1,'2021-08-04 00:00:00'),('customer_812','8c3f1a07','男','15036088043','410185198602221197','学生','贵州-贵阳','customer_003.jpg',1,'2021-04-30 00:00:00'),('customer_814','b82236cb','女','15036088080','410185198602221516','会计','海南-三亚','customer_003.jpg',1,'2017-11-13 00:00:00'),('customer_820','9e8d1144','女','15036088077','410185198602221116','会计','天津-塘沽','customer_003.jpg',1,'2018-06-27 00:00:00'),('customer_825','b50ce624','男','15036088032','410185198602221681','会计','海南-三亚','customer_003.jpg',1,'2013-08-10 00:00:00'),('customer_842','b6566e43','男','15036088081','410185198602221056','会计','海南-三亚','customer_003.jpg',1,'2010-12-18 00:00:00'),('customer_851','8d36ac75','男','15036088081','410185198602221180','学生','贵州-贵阳','customer_003.jpg',1,'2021-01-27 00:00:00'),('customer_858','9e32660e','女','15036088011','410185198602221025','会计','天津-塘沽','customer_003.jpg',1,'2016-06-21 00:00:00'),('customer_859','8d07085e','女','15036088070','410185198602221692','学生','贵州-贵阳','customer_003.jpg',1,'2021-02-19 00:00:00'),('customer_861','8ab4bb56','女','15036088065','410185198602221858','学生','贵州-贵阳','customer_003.jpg',1,'2021-12-23 00:00:00'),('customer_865','b73db7c6','女','15036088059','410185198602221178','会计','海南-三亚','customer_003.jpg',1,'2012-07-23 00:00:00'),('customer_87','7cae629f','女','1503608805','410185198602221183','会计','河南-郑州','customer_003.jpg',1,'2019-03-18 00:00:00'),('customer_883','8b422dd5','男','15036088024','410185198602221856','学生','贵州-贵阳','customer_003.jpg',1,'2021-04-23 00:00:00'),('customer_886','b53f1328','女','15036088066','410185198602221491','会计','海南-三亚','customer_003.jpg',1,'2011-08-20 00:00:00'),('customer_89','9db655d0','男','15036088072','410185198602221579','会计','天津-塘沽','customer_003.jpg',1,'2019-01-16 00:00:00'),('customer_898','79224fdc','男','15036088097','410185198602221239','护士','安徽-亳州','customer_003.jpg',1,'2021-04-13 00:00:00'),('customer_907','78f67638','女','15036088095','410185198602221945','护士','安徽-亳州','customer_003.jpg',1,'2021-10-02 00:00:00'),('customer_908','dd72f5e8','男','15036088044','410185198602221606','会计','甘肃-酒泉','customer_003.jpg',1,'2017-04-09 00:00:00'),('customer_909','de116fcf','女','15036088066','410185198602221880','会计','甘肃-酒泉','customer_003.jpg',1,'2010-05-25 00:00:00'),('customer_92','7cf5c946','男','15036088085','410185198602221884','会计','河南-郑州','customer_003.jpg',1,'2015-11-27 00:00:00'),('customer_920','b3e81562','男','15036088056','410185198602221410','会计','海南-三亚','customer_003.jpg',1,'2012-05-10 00:00:00'),('customer_921','dc36e4e4','女','15036088084','410185198602221569','会计','甘肃-酒泉','customer_003.jpg',1,'2019-09-28 00:00:00'),('customer_929','de2c6452','女','15036088025','410185198602221128','会计','甘肃-酒泉','customer_003.jpg',1,'2012-06-15 00:00:00'),('customer_936','c19659b0','男','15036088062','410185198602221329','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2015-06-29 00:00:00'),('customer_938','9cdceca4','女','15036088035','410185198602221522','会计','天津-塘沽','customer_003.jpg',1,'2015-04-03 00:00:00'),('customer_939','c27f5897','女','1503608805','410185198602221802','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2018-08-29 00:00:00'),('customer_94','89c764db','女','15036088040','410185198602221058','会计','河北-邯郸','customer_003.jpg',1,'2012-02-27 00:00:00'),('customer_940','c3d910c5','男','15036088084','410185198602221573','会计','新疆-乌鲁木齐','customer_003.jpg',1,'2010-07-20 00:00:00'),('customer_942','8bf4d2d7','女','15036088049','410185198602221761','学生','贵州-贵阳','customer_003.jpg',1,'2021-02-01 00:00:00'),('customer_943','aa3a58d8','女','1503608800','410185198602221974','会计','北京-海淀','customer_003.jpg',1,'2020-09-19 00:00:00'),('customer_945','e13ec947','女','15036088053','410185198602221360','老师','江西-九州','customer_001.jpg',1,'2021-10-18 00:00:00'),('customer_951','ac200d21','女','15036088050','410185198602221020','会计','北京-海淀','customer_003.jpg',1,'2011-12-18 00:00:00'),('customer_957','77f64d66','女','15036088010','410185198602221885','护士','安徽-亳州','customer_003.jpg',1,'2021-05-12 00:00:00'),('customer_96','b400857d','女','15036088097','410185198602221864','会计','海南-三亚','customer_003.jpg',1,'2011-08-30 00:00:00'),('customer_960','dc00dff8','女','15036088053','410185198602221474','会计','甘肃-酒泉','customer_003.jpg',1,'2014-08-20 00:00:00'),('customer_961','9e005bb3','女','15036088041','410185198602221755','会计','天津-塘沽','customer_003.jpg',1,'2017-03-03 00:00:00'),('customer_965','9d9d71bd','女','15036088047','410185198602221948','会计','天津-塘沽','customer_003.jpg',1,'2016-05-07 00:00:00'),('customer_97','89f79ea5','女','15036088089','410185198602221731','会计','河北-邯郸','customer_003.jpg',1,'2020-04-09 00:00:00'),('customer_977','8a6a17aa','女','15036088091','410185198602221522','学生','贵州-贵阳','customer_003.jpg',1,'2021-01-17 00:00:00'),('customer_996','8c540df8','女','15036088095','410185198602221440','学生','贵州-贵阳','customer_003.jpg',1,'2021-08-08 00:00:00'),('customer_999','b5c35d17','男','15036088026','410185198602221520','会计','海南-三亚','customer_003.jpg',1,'2018-02-05 00:00:00'),('customer_bc8105d6bd974fc0b11465b7f3841527','11','女','22','11','222','云南省-大理','customer_bc8105d6bd974fc0b11465b7f3841527.jpeg',1,'2012-07-30 00:00:00'),('customer_e186527dba1340e38831810b9ae7d718','韩梅梅','男','18860388000','410185198502225536','护士','河北省-太原','customer_e186527dba1340e38831810b9ae7d718.jpeg',1,'2013-11-04 00:00:00');

/*Table structure for table `tab_department` */

DROP TABLE IF EXISTS `tab_department`;

CREATE TABLE `tab_department` (
  `department_id` varchar(50) NOT NULL,
  `department_name` varchar(10) DEFAULT NULL,
  `department_describe` varchar(1000) DEFAULT NULL,
  PRIMARY KEY (`department_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_department` */

insert  into `tab_department`(`department_id`,`department_name`,`department_describe`) values ('department_001','客户部','客户维护和客户招揽1'),('department_002','车辆部','车辆管理和车辆出入'),('department_003','车检部','车辆检查'),('department_004','董事局','所有事务');

/*Table structure for table `tab_dictionary` */

DROP TABLE IF EXISTS `tab_dictionary`;

CREATE TABLE `tab_dictionary` (
  `dictionary_id` int(11) NOT NULL AUTO_INCREMENT,
  `dictionary_name` varchar(11) DEFAULT NULL,
  `dictionary_type` int(11) DEFAULT NULL,
  `province_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`dictionary_id`),
  KEY `fk_33` (`province_id`),
  CONSTRAINT `fk_33` FOREIGN KEY (`province_id`) REFERENCES `tab_dictionary` (`dictionary_id`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8;

/*Data for the table `tab_dictionary` */

insert  into `tab_dictionary`(`dictionary_id`,`dictionary_name`,`dictionary_type`,`province_id`) values (10,'河南省',1,NULL),(11,'郑州',2,10),(12,'南阳',2,10),(13,'安阳',2,10),(14,'信阳',2,10),(20,'河北省',1,NULL),(21,'石家庄',2,20),(22,'太原',2,20),(23,'邯郸',2,20),(24,'廊坊',2,20),(30,'北京',1,NULL),(31,'丰台',2,30),(32,'海淀',2,30),(33,'朝阳',2,30),(34,'通州',2,30),(40,'云南省',1,NULL),(41,'昆明',2,40),(42,'丽江',2,40),(43,'大理',2,40),(44,'西双版纳',2,40);

/*Table structure for table `tab_role` */

DROP TABLE IF EXISTS `tab_role`;

CREATE TABLE `tab_role` (
  `role_id` varchar(50) NOT NULL,
  `role_name` varchar(50) DEFAULT NULL,
  `role_describe` varchar(200) DEFAULT NULL COMMENT '角色描述',
  PRIMARY KEY (`role_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_role` */

insert  into `tab_role`(`role_id`,`role_name`,`role_describe`) values ('role_01','总经理','可以执行所有操作'),('role_02','部门经理','可以执行除了系统操作以外的所有操作'),('role_03','部门员工','只能执行当前部门的操作和其他部门的查看操作');

/*Table structure for table `tab_role_url` */

DROP TABLE IF EXISTS `tab_role_url`;

CREATE TABLE `tab_role_url` (
  `role_id` varchar(50) NOT NULL DEFAULT '',
  `url_id` varchar(50) NOT NULL DEFAULT '',
  PRIMARY KEY (`role_id`,`url_id`),
  KEY `fk_14` (`url_id`),
  CONSTRAINT `fk_13` FOREIGN KEY (`role_id`) REFERENCES `tab_role` (`role_id`),
  CONSTRAINT `fk_14` FOREIGN KEY (`url_id`) REFERENCES `tab_url` (`url_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_role_url` */

insert  into `tab_role_url`(`role_id`,`url_id`) values ('role_02','url_34597f7ced22424481fe0638426d4c0a'),('role_01','url_4990c3d1c41244c4ac06bea536541f81'),('role_01','url_5073e48130114c4b89b68bac2b749fec'),('role_02','url_5073e48130114c4b89b68bac2b749fec'),('role_02','url_6bf55449482f4a69a28bcd0eb0e7399c'),('role_01','url_6d8c3f6bdef14ebb9d67ade8cf4b86f6'),('role_01','url_7916dbf304774526a2d5461b348bd83a'),('role_01','url_890f9bbafb614e51a50bde87df7f1f9d'),('role_01','url_8a7e0fd8a1934f20b3fa1642085a3637'),('role_01','url_8aad4242efab4392803978818eebcee8'),('role_01','url_9737045f3f0046fba7407271446646d9'),('role_01','url_97a90555ef424575a79391c5ad5a7386'),('role_01','url_b66c5fb87ca348cfac133a68ed07c462'),('role_01','url_e5c72475b3d5492e80220bc4b99fac3d'),('role_01','url_f5623792f14340a18803a5a019f5c03b');

/*Table structure for table `tab_url` */

DROP TABLE IF EXISTS `tab_url`;

CREATE TABLE `tab_url` (
  `url_id` varchar(50) NOT NULL,
  `url_path` varchar(50) DEFAULT NULL,
  `url_name` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`url_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_url` */

insert  into `tab_url`(`url_id`,`url_path`,`url_name`) values ('url_34597f7ced22424481fe0638426d4c0a','/department/update','部门修改'),('url_4990c3d1c41244c4ac06bea536541f81','/carCheck/delete','车检删除'),('url_5073e48130114c4b89b68bac2b749fec','/carCheck/update','车检修改'),('url_6110e6458eba4e1f91a2f7777a109add','/role/add','角色添加'),('url_6bf55449482f4a69a28bcd0eb0e7399c','/user/delete','用户删除'),('url_6d8c3f6bdef14ebb9d67ade8cf4b86f6','/car/add','车辆添加'),('url_7916dbf304774526a2d5461b348bd83a','/customer/get','客户获取'),('url_890f9bbafb614e51a50bde87df7f1f9d','/user/get','用户获取'),('url_8a7e0fd8a1934f20b3fa1642085a3637','/customer/update','客户修改'),('url_8aad4242efab4392803978818eebcee8','/department/get','部门获取'),('url_9737045f3f0046fba7407271446646d9','/car/update','车辆修改'),('url_97a90555ef424575a79391c5ad5a7386','/url/update','操作修改'),('url_998b5c34a2c94326a88f8ae2b6aaabe8','/url/add','操作添加'),('url_9ea334de6e194961947cc54a638ed901','/url/delete','操作删除'),('url_a4df24fd0a0c4e9b8f5c15a0fa7e8bf0','/user/update','用户修改'),('url_a82a51cb822f4e5ba4347b7a11ad19eb','/role/delete','角色删除'),('url_b66c5fb87ca348cfac133a68ed07c462','/role/get','角色获取'),('url_b86e1f6959a14a9891e231fbf30ae4ec','/car/get','车辆获取'),('url_bc45a416d9544233be86027a49f462e1','/department/delete','部门删除'),('url_cbc623c5bd96445280dbbb6977dc7a86','/role/update','接受修改'),('url_d1736235bbf14ff48df7494a53410fa9','/department/add','部门添加'),('url_dbbdbd1f7dc04b80b44fc8727f245ae2','/carCheck/add','车检添加'),('url_e14f52dbf4384883975e6c549aa85616','/customer/add','客户添加'),('url_e2269a7a1863409593a3eaa95a8816f4','/carCheck/get','车检获取'),('url_e54ba54d834841c59e59181585f913b3','/car/delete','车辆删除'),('url_e5c72475b3d5492e80220bc4b99fac3d','/customer/delete','客户删除'),('url_ea22d25c590c47848cf458769c167dfb','/user/add','用户添加'),('url_f5623792f14340a18803a5a019f5c03b','/url/get','删除获取');

/*Table structure for table `tab_user` */

DROP TABLE IF EXISTS `tab_user`;

CREATE TABLE `tab_user` (
  `user_id` varchar(50) NOT NULL,
  `user_name` varchar(10) DEFAULT NULL,
  `user_sex` char(1) DEFAULT NULL,
  `user_pwd` varchar(50) DEFAULT NULL,
  `user_phone` char(11) DEFAULT NULL,
  `user_photo` varchar(100) DEFAULT NULL,
  `department_id` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`user_id`),
  KEY `fk_15` (`department_id`),
  CONSTRAINT `fk_15` FOREIGN KEY (`department_id`) REFERENCES `tab_department` (`department_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_user` */

insert  into `tab_user`(`user_id`,`user_name`,`user_sex`,`user_pwd`,`user_phone`,`user_photo`,`department_id`) values ('user_0011','张工','男','e10adc3949ba59abbe56e057f20f883e','15036088049','user_0011.jpeg','department_001'),('user_0012','张总','男','e10adc3949ba59abbe56e057f20f883e','15036088042','user_0012.jpeg','department_001'),('user_0013','王工','男','e10adc3949ba59abbe56e057f20f883e','15036088049','user_0013.jpeg','department_002'),('user_0014','王总','男','e10adc3949ba59abbe56e057f20f883e','15036088049','user_0014.jpeg','department_002'),('user_0015','刘工','男','e10adc3949ba59abbe56e057f20f883e','15036088049','user_0015.jpeg','department_003'),('user_0016','刘总','男','e10adc3949ba59abbe56e057f20f883e','15036088049','user_0016.jpeg','department_003'),('user_0017','高经理','男','e10adc3949ba59abbe56e057f20f883e','15036088049','user_0017.jpeg','department_004'),('user_c79106f1b0df41cbb925aad6d5a9de58','呵呵','男','123456','22222222222','user_c79106f1b0df41cbb925aad6d5a9de58.jpeg','department_003');

/*Table structure for table `tab_user_role` */

DROP TABLE IF EXISTS `tab_user_role`;

CREATE TABLE `tab_user_role` (
  `user_id` varchar(50) NOT NULL DEFAULT '',
  `role_id` varchar(50) NOT NULL DEFAULT '',
  PRIMARY KEY (`user_id`,`role_id`),
  KEY `fk_12` (`role_id`),
  CONSTRAINT `fk_11` FOREIGN KEY (`user_id`) REFERENCES `tab_user` (`user_id`),
  CONSTRAINT `fk_12` FOREIGN KEY (`role_id`) REFERENCES `tab_role` (`role_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `tab_user_role` */

insert  into `tab_user_role`(`user_id`,`role_id`) values ('user_0017','role_01'),('user_0012','role_02'),('user_0014','role_02'),('user_0016','role_02'),('user_0011','role_03'),('user_0013','role_03'),('user_0015','role_03');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
